GopalSaraf/Practicals/PSDL/include/proc/pic16lf19195.inc
// Register: ALRMSEC
#define ALRMSEC ALRMSEC
ALRMSEC                                  equ 0C1Ch
// bitfield definitions
ALRMSEC_ALRMLSEC_POSN                    equ 0000h
ALRMSEC_ALRMLSEC_POSITION                equ 0000h
ALRMSEC_ALRMLSEC_SIZE                    equ 0004h
ALRMSEC_ALRMLSEC_LENGTH                  equ 0004h
ALRMSEC_ALRMLSEC_MASK                    equ 000Fh
ALRMSEC_ALRMHSEC_POSN                    equ 0004h
ALRMSEC_ALRMHSEC_POSITION                equ 0004h
ALRMSEC_ALRMHSEC_SIZE                    equ 0003h
ALRMSEC_ALRMHSEC_LENGTH                  equ 0003h
ALRMSEC_ALRMHSEC_MASK                    equ 0070h
ALRMSEC_ALRMLSEC0_POSN                   equ 0000h
ALRMSEC_ALRMLSEC0_POSITION               equ 0000h
ALRMSEC_ALRMLSEC0_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC0_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC0_MASK                   equ 0001h
ALRMSEC_ALRMLSEC1_POSN                   equ 0001h
ALRMSEC_ALRMLSEC1_POSITION               equ 0001h
ALRMSEC_ALRMLSEC1_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC1_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC1_MASK                   equ 0002h
ALRMSEC_ALRMLSEC2_POSN                   equ 0002h
ALRMSEC_ALRMLSEC2_POSITION               equ 0002h
ALRMSEC_ALRMLSEC2_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC2_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC2_MASK                   equ 0004h
ALRMSEC_ALRMLSEC3_POSN                   equ 0003h
ALRMSEC_ALRMLSEC3_POSITION               equ 0003h
ALRMSEC_ALRMLSEC3_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC3_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC3_MASK                   equ 0008h
ALRMSEC_ALRMHSEC0_POSN                   equ 0004h
ALRMSEC_ALRMHSEC0_POSITION               equ 0004h
ALRMSEC_ALRMHSEC0_SIZE                   equ 0001h
ALRMSEC_ALRMHSEC0_LENGTH                 equ 0001h
ALRMSEC_ALRMHSEC0_MASK                   equ 0010h
ALRMSEC_ALRMHSEC1_POSN                   equ 0005h
ALRMSEC_ALRMHSEC1_POSITION               equ 0005h
ALRMSEC_ALRMHSEC1_SIZE                   equ 0001h
ALRMSEC_ALRMHSEC1_LENGTH                 equ 0001h
ALRMSEC_ALRMHSEC1_MASK                   equ 0020h
ALRMSEC_ALRMHSEC2_POSN                   equ 0006h
ALRMSEC_ALRMHSEC2_POSITION               equ 0006h
ALRMSEC_ALRMHSEC2_SIZE                   equ 0001h
ALRMSEC_ALRMHSEC2_LENGTH                 equ 0001h
ALRMSEC_ALRMHSEC2_MASK                   equ 0040h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0C8Ch
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h
PORTG_RG6_POSN                           equ 0006h
PORTG_RG6_POSITION                       equ 0006h
PORTG_RG6_SIZE                           equ 0001h
PORTG_RG6_LENGTH                         equ 0001h
PORTG_RG6_MASK                           equ 0040h
PORTG_RG7_POSN                           equ 0007h
PORTG_RG7_POSITION                       equ 0007h
PORTG_RG7_SIZE                           equ 0001h
PORTG_RG7_LENGTH                         equ 0001h
PORTG_RG7_MASK                           equ 0080h

// Register: PORTH
#define PORTH PORTH
PORTH                                    equ 0C8Dh
// bitfield definitions
PORTH_RH0_POSN                           equ 0000h
PORTH_RH0_POSITION                       equ 0000h
PORTH_RH0_SIZE                           equ 0001h
PORTH_RH0_LENGTH                         equ 0001h
PORTH_RH0_MASK                           equ 0001h
PORTH_RH1_POSN                           equ 0001h
PORTH_RH1_POSITION                       equ 0001h
PORTH_RH1_SIZE                           equ 0001h
PORTH_RH1_LENGTH                         equ 0001h
PORTH_RH1_MASK                           equ 0002h
PORTH_RH2_POSN                           equ 0002h
PORTH_RH2_POSITION                       equ 0002h
PORTH_RH2_SIZE                           equ 0001h
PORTH_RH2_LENGTH                         equ 0001h
PORTH_RH2_MASK                           equ 0004h
PORTH_RH3_POSN                           equ 0003h
PORTH_RH3_POSITION                       equ 0003h
PORTH_RH3_SIZE                           equ 0001h
PORTH_RH3_LENGTH                         equ 0001h
PORTH_RH3_MASK                           equ 0008h

// Register: TRISG
#define TRISG TRISG
TRISG                                    equ 0C8Eh
// bitfield definitions
TRISG_TRISG0_POSN                        equ 0000h
TRISG_TRISG0_POSITION                    equ 0000h
TRISG_TRISG0_SIZE                        equ 0001h
TRISG_TRISG0_LENGTH                      equ 0001h
TRISG_TRISG0_MASK                        equ 0001h
TRISG_TRISG1_POSN                        equ 0001h
TRISG_TRISG1_POSITION                    equ 0001h
TRISG_TRISG1_SIZE                        equ 0001h
TRISG_TRISG1_LENGTH                      equ 0001h
TRISG_TRISG1_MASK                        equ 0002h
TRISG_TRISG2_POSN                        equ 0002h
TRISG_TRISG2_POSITION                    equ 0002h
TRISG_TRISG2_SIZE                        equ 0001h
TRISG_TRISG2_LENGTH                      equ 0001h
TRISG_TRISG2_MASK                        equ 0004h
TRISG_TRISG3_POSN                        equ 0003h
TRISG_TRISG3_POSITION                    equ 0003h
TRISG_TRISG3_SIZE                        equ 0001h
TRISG_TRISG3_LENGTH                      equ 0001h
TRISG_TRISG3_MASK                        equ 0008h
TRISG_TRISG4_POSN                        equ 0004h
TRISG_TRISG4_POSITION                    equ 0004h
TRISG_TRISG4_SIZE                        equ 0001h
TRISG_TRISG4_LENGTH                      equ 0001h
TRISG_TRISG4_MASK                        equ 0010h
TRISG_TRISG6_POSN                        equ 0006h
TRISG_TRISG6_POSITION                    equ 0006h
TRISG_TRISG6_SIZE                        equ 0001h
TRISG_TRISG6_LENGTH                      equ 0001h
TRISG_TRISG6_MASK                        equ 0040h
TRISG_TRISG7_POSN                        equ 0007h
TRISG_TRISG7_POSITION                    equ 0007h
TRISG_TRISG7_SIZE                        equ 0001h
TRISG_TRISG7_LENGTH                      equ 0001h
TRISG_TRISG7_MASK                        equ 0080h

// Register: TRISH
#define TRISH TRISH
TRISH                                    equ 0C8Fh
// bitfield definitions
TRISH_TRISH0_POSN                        equ 0000h
TRISH_TRISH0_POSITION                    equ 0000h
TRISH_TRISH0_SIZE                        equ 0001h
TRISH_TRISH0_LENGTH                      equ 0001h
TRISH_TRISH0_MASK                        equ 0001h
TRISH_TRISH1_POSN                        equ 0001h
TRISH_TRISH1_POSITION                    equ 0001h
TRISH_TRISH1_SIZE                        equ 0001h
TRISH_TRISH1_LENGTH                      equ 0001h
TRISH_TRISH1_MASK                        equ 0002h
TRISH_TRISH2_POSN                        equ 0002h
TRISH_TRISH2_POSITION                    equ 0002h
TRISH_TRISH2_SIZE                        equ 0001h
TRISH_TRISH2_LENGTH                      equ 0001h
TRISH_TRISH2_MASK                        equ 0004h
TRISH_TRISH3_POSN                        equ 0003h
TRISH_TRISH3_POSITION                    equ 0003h
TRISH_TRISH3_SIZE                        equ 0001h
TRISH_TRISH3_LENGTH                      equ 0001h
TRISH_TRISH3_MASK                        equ 0008h

// Register: LATG
#define LATG LATG
LATG                                     equ 0C90h
// bitfield definitions
LATG_LATG0_POSN                          equ 0000h
LATG_LATG0_POSITION                      equ 0000h
LATG_LATG0_SIZE                          equ 0001h
LATG_LATG0_LENGTH                        equ 0001h
LATG_LATG0_MASK                          equ 0001h
LATG_LATG1_POSN                          equ 0001h
LATG_LATG1_POSITION                      equ 0001h
LATG_LATG1_SIZE                          equ 0001h
LATG_LATG1_LENGTH                        equ 0001h
LATG_LATG1_MASK                          equ 0002h
LATG_LATG2_POSN                          equ 0002h
LATG_LATG2_POSITION                      equ 0002h
LATG_LATG2_SIZE                          equ 0001h
LATG_LATG2_LENGTH                        equ 0001h
LATG_LATG2_MASK                          equ 0004h
LATG_LATG3_POSN                          equ 0003h
LATG_LATG3_POSITION                      equ 0003h
LATG_LATG3_SIZE                          equ 0001h
LATG_LATG3_LENGTH                        equ 0001h
LATG_LATG3_MASK                          equ 0008h
LATG_LATG4_POSN                          equ 0004h
LATG_LATG4_POSITION                      equ 0004h
LATG_LATG4_SIZE                          equ 0001h
LATG_LATG4_LENGTH                        equ 0001h
LATG_LATG4_MASK                          equ 0010h
LATG_LATG6_POSN                          equ 0006h
LATG_LATG6_POSITION                      equ 0006h
LATG_LATG6_SIZE                          equ 0001h
LATG_LATG6_LENGTH                        equ 0001h
LATG_LATG6_MASK                          equ 0040h
LATG_LATG7_POSN                          equ 0007h
LATG_LATG7_POSITION                      equ 0007h
LATG_LATG7_SIZE                          equ 0001h
LATG_LATG7_LENGTH                        equ 0001h
LATG_LATG7_MASK                          equ 0080h

