GopalSaraf/Practicals/PSDL/include/proc/pic16lf19195.inc
// Register: CLC4GLS2
#define CLC4GLS2 CLC4GLS2
CLC4GLS2                                 equ 01E36h
// bitfield definitions
CLC4GLS2_LC4G3D1N_POSN                   equ 0000h
CLC4GLS2_LC4G3D1N_POSITION               equ 0000h
CLC4GLS2_LC4G3D1N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D1N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D1N_MASK                   equ 0001h
CLC4GLS2_LC4G3D1T_POSN                   equ 0001h
CLC4GLS2_LC4G3D1T_POSITION               equ 0001h
CLC4GLS2_LC4G3D1T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D1T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D1T_MASK                   equ 0002h
CLC4GLS2_LC4G3D2N_POSN                   equ 0002h
CLC4GLS2_LC4G3D2N_POSITION               equ 0002h
CLC4GLS2_LC4G3D2N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D2N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D2N_MASK                   equ 0004h
CLC4GLS2_LC4G3D2T_POSN                   equ 0003h
CLC4GLS2_LC4G3D2T_POSITION               equ 0003h
CLC4GLS2_LC4G3D2T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D2T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D2T_MASK                   equ 0008h
CLC4GLS2_LC4G3D3N_POSN                   equ 0004h
CLC4GLS2_LC4G3D3N_POSITION               equ 0004h
CLC4GLS2_LC4G3D3N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D3N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D3N_MASK                   equ 0010h
CLC4GLS2_LC4G3D3T_POSN                   equ 0005h
CLC4GLS2_LC4G3D3T_POSITION               equ 0005h
CLC4GLS2_LC4G3D3T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D3T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D3T_MASK                   equ 0020h
CLC4GLS2_LC4G3D4N_POSN                   equ 0006h
CLC4GLS2_LC4G3D4N_POSITION               equ 0006h
CLC4GLS2_LC4G3D4N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D4N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D4N_MASK                   equ 0040h
CLC4GLS2_LC4G3D4T_POSN                   equ 0007h
CLC4GLS2_LC4G3D4T_POSITION               equ 0007h
CLC4GLS2_LC4G3D4T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D4T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D4T_MASK                   equ 0080h
CLC4GLS2_D1N_POSN                        equ 0000h
CLC4GLS2_D1N_POSITION                    equ 0000h
CLC4GLS2_D1N_SIZE                        equ 0001h
CLC4GLS2_D1N_LENGTH                      equ 0001h
CLC4GLS2_D1N_MASK                        equ 0001h
CLC4GLS2_D1T_POSN                        equ 0001h
CLC4GLS2_D1T_POSITION                    equ 0001h
CLC4GLS2_D1T_SIZE                        equ 0001h
CLC4GLS2_D1T_LENGTH                      equ 0001h
CLC4GLS2_D1T_MASK                        equ 0002h
CLC4GLS2_D2N_POSN                        equ 0002h
CLC4GLS2_D2N_POSITION                    equ 0002h
CLC4GLS2_D2N_SIZE                        equ 0001h
CLC4GLS2_D2N_LENGTH                      equ 0001h
CLC4GLS2_D2N_MASK                        equ 0004h
CLC4GLS2_D2T_POSN                        equ 0003h
CLC4GLS2_D2T_POSITION                    equ 0003h
CLC4GLS2_D2T_SIZE                        equ 0001h
CLC4GLS2_D2T_LENGTH                      equ 0001h
CLC4GLS2_D2T_MASK                        equ 0008h
CLC4GLS2_D3N_POSN                        equ 0004h
CLC4GLS2_D3N_POSITION                    equ 0004h
CLC4GLS2_D3N_SIZE                        equ 0001h
CLC4GLS2_D3N_LENGTH                      equ 0001h
CLC4GLS2_D3N_MASK                        equ 0010h
CLC4GLS2_D3T_POSN                        equ 0005h
CLC4GLS2_D3T_POSITION                    equ 0005h
CLC4GLS2_D3T_SIZE                        equ 0001h
CLC4GLS2_D3T_LENGTH                      equ 0001h
CLC4GLS2_D3T_MASK                        equ 0020h
CLC4GLS2_D4N_POSN                        equ 0006h
CLC4GLS2_D4N_POSITION                    equ 0006h
CLC4GLS2_D4N_SIZE                        equ 0001h
CLC4GLS2_D4N_LENGTH                      equ 0001h
CLC4GLS2_D4N_MASK                        equ 0040h
CLC4GLS2_D4T_POSN                        equ 0007h
CLC4GLS2_D4T_POSITION                    equ 0007h
CLC4GLS2_D4T_SIZE                        equ 0001h
CLC4GLS2_D4T_LENGTH                      equ 0001h
CLC4GLS2_D4T_MASK                        equ 0080h

// Register: CLC4GLS3
#define CLC4GLS3 CLC4GLS3
CLC4GLS3                                 equ 01E37h
// bitfield definitions
CLC4GLS3_LC4G4D1N_POSN                   equ 0000h
CLC4GLS3_LC4G4D1N_POSITION               equ 0000h
CLC4GLS3_LC4G4D1N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D1N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D1N_MASK                   equ 0001h
CLC4GLS3_LC4G4D1T_POSN                   equ 0001h
CLC4GLS3_LC4G4D1T_POSITION               equ 0001h
CLC4GLS3_LC4G4D1T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D1T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D1T_MASK                   equ 0002h
CLC4GLS3_LC4G4D2N_POSN                   equ 0002h
CLC4GLS3_LC4G4D2N_POSITION               equ 0002h
CLC4GLS3_LC4G4D2N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D2N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D2N_MASK                   equ 0004h
CLC4GLS3_LC4G4D2T_POSN                   equ 0003h
CLC4GLS3_LC4G4D2T_POSITION               equ 0003h
CLC4GLS3_LC4G4D2T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D2T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D2T_MASK                   equ 0008h
CLC4GLS3_LC4G4D3N_POSN                   equ 0004h
CLC4GLS3_LC4G4D3N_POSITION               equ 0004h
CLC4GLS3_LC4G4D3N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D3N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D3N_MASK                   equ 0010h
CLC4GLS3_LC4G4D3T_POSN                   equ 0005h
CLC4GLS3_LC4G4D3T_POSITION               equ 0005h
CLC4GLS3_LC4G4D3T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D3T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D3T_MASK                   equ 0020h
CLC4GLS3_LC4G4D4N_POSN                   equ 0006h
CLC4GLS3_LC4G4D4N_POSITION               equ 0006h
CLC4GLS3_LC4G4D4N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D4N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D4N_MASK                   equ 0040h
CLC4GLS3_LC4G4D4T_POSN                   equ 0007h
CLC4GLS3_LC4G4D4T_POSITION               equ 0007h
CLC4GLS3_LC4G4D4T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D4T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D4T_MASK                   equ 0080h
CLC4GLS3_G4D1N_POSN                      equ 0000h
CLC4GLS3_G4D1N_POSITION                  equ 0000h
CLC4GLS3_G4D1N_SIZE                      equ 0001h
CLC4GLS3_G4D1N_LENGTH                    equ 0001h
CLC4GLS3_G4D1N_MASK                      equ 0001h
CLC4GLS3_G4D1T_POSN                      equ 0001h
CLC4GLS3_G4D1T_POSITION                  equ 0001h
CLC4GLS3_G4D1T_SIZE                      equ 0001h
CLC4GLS3_G4D1T_LENGTH                    equ 0001h
CLC4GLS3_G4D1T_MASK                      equ 0002h
CLC4GLS3_G4D2N_POSN                      equ 0002h
CLC4GLS3_G4D2N_POSITION                  equ 0002h
CLC4GLS3_G4D2N_SIZE                      equ 0001h
CLC4GLS3_G4D2N_LENGTH                    equ 0001h
CLC4GLS3_G4D2N_MASK                      equ 0004h
CLC4GLS3_G4D2T_POSN                      equ 0003h
CLC4GLS3_G4D2T_POSITION                  equ 0003h
CLC4GLS3_G4D2T_SIZE                      equ 0001h
CLC4GLS3_G4D2T_LENGTH                    equ 0001h
CLC4GLS3_G4D2T_MASK                      equ 0008h
CLC4GLS3_G4D3N_POSN                      equ 0004h
CLC4GLS3_G4D3N_POSITION                  equ 0004h
CLC4GLS3_G4D3N_SIZE                      equ 0001h
CLC4GLS3_G4D3N_LENGTH                    equ 0001h
CLC4GLS3_G4D3N_MASK                      equ 0010h
CLC4GLS3_G4D3T_POSN                      equ 0005h
CLC4GLS3_G4D3T_POSITION                  equ 0005h
CLC4GLS3_G4D3T_SIZE                      equ 0001h
CLC4GLS3_G4D3T_LENGTH                    equ 0001h
CLC4GLS3_G4D3T_MASK                      equ 0020h
CLC4GLS3_G4D4N_POSN                      equ 0006h
CLC4GLS3_G4D4N_POSITION                  equ 0006h
CLC4GLS3_G4D4N_SIZE                      equ 0001h
CLC4GLS3_G4D4N_LENGTH                    equ 0001h
CLC4GLS3_G4D4N_MASK                      equ 0040h
CLC4GLS3_G4D4T_POSN                      equ 0007h
CLC4GLS3_G4D4T_POSITION                  equ 0007h
CLC4GLS3_G4D4T_SIZE                      equ 0001h
CLC4GLS3_G4D4T_LENGTH                    equ 0001h
CLC4GLS3_G4D4T_MASK                      equ 0080h

// Register: RF0PPS
#define RF0PPS RF0PPS
RF0PPS                                   equ 01E38h
// bitfield definitions
RF0PPS_RF0PPS0_POSN                      equ 0000h
RF0PPS_RF0PPS0_POSITION                  equ 0000h
RF0PPS_RF0PPS0_SIZE                      equ 0001h
RF0PPS_RF0PPS0_LENGTH                    equ 0001h
RF0PPS_RF0PPS0_MASK                      equ 0001h
RF0PPS_RF0PPS1_POSN                      equ 0001h
RF0PPS_RF0PPS1_POSITION                  equ 0001h
RF0PPS_RF0PPS1_SIZE                      equ 0001h
RF0PPS_RF0PPS1_LENGTH                    equ 0001h
RF0PPS_RF0PPS1_MASK                      equ 0002h
RF0PPS_RF0PPS2_POSN                      equ 0002h
RF0PPS_RF0PPS2_POSITION                  equ 0002h
RF0PPS_RF0PPS2_SIZE                      equ 0001h
RF0PPS_RF0PPS2_LENGTH                    equ 0001h
RF0PPS_RF0PPS2_MASK                      equ 0004h
RF0PPS_RF0PPS3_POSN                      equ 0003h
RF0PPS_RF0PPS3_POSITION                  equ 0003h
RF0PPS_RF0PPS3_SIZE                      equ 0001h
RF0PPS_RF0PPS3_LENGTH                    equ 0001h
RF0PPS_RF0PPS3_MASK                      equ 0008h
RF0PPS_RF0PPS4_POSN                      equ 0004h
RF0PPS_RF0PPS4_POSITION                  equ 0004h
RF0PPS_RF0PPS4_SIZE                      equ 0001h
RF0PPS_RF0PPS4_LENGTH                    equ 0001h
RF0PPS_RF0PPS4_MASK                      equ 0010h
RF0PPS_RF0PPS5_POSN                      equ 0005h
RF0PPS_RF0PPS5_POSITION                  equ 0005h
RF0PPS_RF0PPS5_SIZE                      equ 0001h
RF0PPS_RF0PPS5_LENGTH                    equ 0001h
RF0PPS_RF0PPS5_MASK                      equ 0020h

// Register: RF1PPS
#define RF1PPS RF1PPS
RF1PPS                                   equ 01E39h
// bitfield definitions
RF1PPS_RF1PPS0_POSN                      equ 0000h
RF1PPS_RF1PPS0_POSITION                  equ 0000h
RF1PPS_RF1PPS0_SIZE                      equ 0001h
RF1PPS_RF1PPS0_LENGTH                    equ 0001h
RF1PPS_RF1PPS0_MASK                      equ 0001h
RF1PPS_RF1PPS1_POSN                      equ 0001h
RF1PPS_RF1PPS1_POSITION                  equ 0001h
RF1PPS_RF1PPS1_SIZE                      equ 0001h
RF1PPS_RF1PPS1_LENGTH                    equ 0001h
RF1PPS_RF1PPS1_MASK                      equ 0002h
RF1PPS_RF1PPS2_POSN                      equ 0002h
RF1PPS_RF1PPS2_POSITION                  equ 0002h
RF1PPS_RF1PPS2_SIZE                      equ 0001h
RF1PPS_RF1PPS2_LENGTH                    equ 0001h
RF1PPS_RF1PPS2_MASK                      equ 0004h
RF1PPS_RF1PPS3_POSN                      equ 0003h
RF1PPS_RF1PPS3_POSITION                  equ 0003h
RF1PPS_RF1PPS3_SIZE                      equ 0001h
RF1PPS_RF1PPS3_LENGTH                    equ 0001h
RF1PPS_RF1PPS3_MASK                      equ 0008h
RF1PPS_RF1PPS4_POSN                      equ 0004h
RF1PPS_RF1PPS4_POSITION                  equ 0004h
RF1PPS_RF1PPS4_SIZE                      equ 0001h
RF1PPS_RF1PPS4_LENGTH                    equ 0001h
RF1PPS_RF1PPS4_MASK                      equ 0010h
RF1PPS_RF1PPS5_POSN                      equ 0005h
RF1PPS_RF1PPS5_POSITION                  equ 0005h
RF1PPS_RF1PPS5_SIZE                      equ 0001h
RF1PPS_RF1PPS5_LENGTH                    equ 0001h
RF1PPS_RF1PPS5_MASK                      equ 0020h

// Register: RF2PPS
#define RF2PPS RF2PPS
RF2PPS                                   equ 01E3Ah
// bitfield definitions
RF2PPS_RF2PPS0_POSN                      equ 0000h
RF2PPS_RF2PPS0_POSITION                  equ 0000h
RF2PPS_RF2PPS0_SIZE                      equ 0001h
RF2PPS_RF2PPS0_LENGTH                    equ 0001h
RF2PPS_RF2PPS0_MASK                      equ 0001h
RF2PPS_RF2PPS1_POSN                      equ 0001h
RF2PPS_RF2PPS1_POSITION                  equ 0001h
RF2PPS_RF2PPS1_SIZE                      equ 0001h
RF2PPS_RF2PPS1_LENGTH                    equ 0001h
RF2PPS_RF2PPS1_MASK                      equ 0002h
RF2PPS_RF2PPS2_POSN                      equ 0002h
RF2PPS_RF2PPS2_POSITION                  equ 0002h
RF2PPS_RF2PPS2_SIZE                      equ 0001h
RF2PPS_RF2PPS2_LENGTH                    equ 0001h
RF2PPS_RF2PPS2_MASK                      equ 0004h
RF2PPS_RF2PPS3_POSN                      equ 0003h
RF2PPS_RF2PPS3_POSITION                  equ 0003h
RF2PPS_RF2PPS3_SIZE                      equ 0001h
RF2PPS_RF2PPS3_LENGTH                    equ 0001h
RF2PPS_RF2PPS3_MASK                      equ 0008h
RF2PPS_RF2PPS4_POSN                      equ 0004h
RF2PPS_RF2PPS4_POSITION                  equ 0004h
RF2PPS_RF2PPS4_SIZE                      equ 0001h
RF2PPS_RF2PPS4_LENGTH                    equ 0001h
RF2PPS_RF2PPS4_MASK                      equ 0010h
RF2PPS_RF2PPS5_POSN                      equ 0005h
RF2PPS_RF2PPS5_POSITION                  equ 0005h
RF2PPS_RF2PPS5_SIZE                      equ 0001h
RF2PPS_RF2PPS5_LENGTH                    equ 0001h
RF2PPS_RF2PPS5_MASK                      equ 0020h

